blog/drafts/understand-wavefunction-collapse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-28 Thu 02:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wavefunction Collapse I - The Simplest Tiled Model</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Wavefunction Collapse I - The Simplest Tiled Model</h1>
<p>
In a similar fashion to <a href="file:///home/runner/projects/thetypicalset/org/blog/solve-sudokus-kanren.html">Peter Norvig's solution to the sudoku</a>, a lot of thought is given to the. WaveFunction Collapse is one search strategy among many strategy possible.
</p>

<p>
Image generation does lend itself quite naturally to <i>declarative programming</i>: what matters is not the process by which an image is generated but what that image looks like.
</p>

<p>
I have come accross
</p>

<p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://robertheaton.com/2018/12/17/wavefunction-collapse-algorithm/">This link</a> has a simple explanation of Wavefunction Collapse in terms of constraint propagation.
</p>

<p>
The first wavefunction is a superposition of every possible results (akin to logic variables). Collapsing is taking one possible solution at random from all the possiblities. This choice has consequences that ripple out throught the rest of the solution space -&gt; remove the solutions that become impossible conditional to the first choice you made. Repeat until everything is collapsed or until you've met a <i>contradiction</i> (which makes collapse impossible). Start again if it fails.
</p>

<p>
Here we try to arrange pixels in an input image.
</p>

<div id="outline-container-orgd847c50" class="outline-2">
<h2 id="orgd847c50">Even simpler tiled model</h2>
<div class="outline-text-2" id="text-orgd847c50">
<p>
In the <i>Even Simpler Tiled Model</i> we specify the adjacency rules between pixels of a single color.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">a</span> = ((<span style="font-style: italic;">"sea"</span>, <span style="font-style: italic;">"coast"</span>), (<span style="font-style: italic;">"coast"</span>, <span style="font-style: italic;">"sea"</span>))
</pre>
</div>

<p>
We can have the program parse an input image and learn adjacencies from this.
</p>
</div>
</div>

<div id="outline-container-orgffaf48a" class="outline-2">
<h2 id="orgffaf48a">Simple tiled model</h2>
<div class="outline-text-2" id="text-orgffaf48a">
<p>
Small number of small pre-defined tiles that define "rules" such as land, sea, coast, mountains. We choose the tile with the lowest entropy to collapse the wavefunction.
</p>

<p>
Initially the state is completely unobserved:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> <span style="font-weight: bold;">vars</span>

<span style="font-weight: bold; font-style: italic;">width</span> = 10
<span style="font-weight: bold; font-style: italic;">height</span> = 10

<span style="font-weight: bold; font-style: italic;">grid</span> = <span style="font-weight: bold;">vars</span>(width * height)
</pre>
</div>

<p>
Well actually, each pixel value is constrained to be one of the colors of the input bitmap
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> lall, membero

<span style="font-weight: bold; font-style: italic;">BITMAP</span> = (1, 2, 3, 4)
<span style="font-weight: bold; font-style: italic;">goal</span> = lall(*<span style="font-weight: bold;">tuple</span>(membero(pixel, BITMAP) <span style="font-weight: bold;">for</span> pixel <span style="font-weight: bold;">in</span> grid))
</pre>
</div>

<p>
From what I understand the resulting grid can only be a combination of the input tiles. Let's consider a simple grid with 1x2 tiles:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">input_tile</span> = [(1, 2), (1, 1), (2, 3)]
<span style="font-weight: bold; font-style: italic;">target_tiles</span> = get_tiles(grid)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">extract tiles from the target grid</span>
<span style="font-weight: bold; font-style: italic;">goal</span> = lall(*<span style="font-weight: bold;">tuple</span>(lany(*<span style="font-weight: bold;">tuple</span>(membero(tile, model) <span style="font-weight: bold;">for</span> model <span style="font-weight: bold;">in</span> input_tiles)) <span style="font-weight: bold;">for</span> tile <span style="font-weight: bold;">in</span> target_tiles))
</pre>
</div>

<p>
So really the complicated thing is extracting the tiles in the grid and how you do that. Manage symmetries is just applying transforms to the input.
</p>
</div>
</div>
</div>
</body>
</html>
